var s = new Array();
s[0] = "載入中...";
s[1] = "狀態";
s[2] = "正在驗證信息...";
s[3] = "登錄失敗";
s[4] = "發生錯誤";
s[5] = "無法連接到服務器";
s[6] = "錯誤";
s[7] = "請輸入完整";
s[8] = "VOS3000";
s[9] = "Web自助系統";
s[10] = "系統登錄";
s[11] = "名　稱";
s[12] = "密　碼";
s[13] = "登　錄";
s[14] = "關閉";
s[15] = "關閉其他";
s[16] = "系統導航";
s[17] = "系統菜單";
s[18] = "話機查詢";
s[19] = "網關查詢";
s[20] = "賬戶查詢";
s[21] = "自助服務";
s[22] = "網關費用匯總";
s[23] = "費用匯總";
s[24] = "網關話單查詢";
s[25] = "話單查詢";
s[26] = "網關密碼修改";
s[27] = "密碼修改";
s[28] = "話機費用匯總";
s[29] = "話機話單查詢";
s[30] = "話機密碼修改";
s[31] = "話機補充業務";
s[32] = "補充業務";
s[33] = "賬戶費用匯總";
s[34] = "賬戶話單查詢";
s[35] = "賬戶基礎費率查詢";
s[36] = "基礎費率查詢";
s[37] = "賬戶繳費查詢";
s[38] = "繳費查詢";
s[39] = "賬戶信息修改";
s[40] = "信息修改";
s[41] = "賬戶充值";
s[42] = "查詢失敗";
s[43] = "系統導航";
s[44] = "Web自助查詢";
s[45] = "登錄名稱";
s[46] = "登錄類型";
s[47] = "賬戶號碼";
s[48] = "賬戶名稱";
s[49] = "賬戶餘額";
s[50] = "透支限額";
s[51] = "話　機";
s[52] = "對接網關";
s[53] = "處理中...";
s[54] = "信息";
s[55] = "充值成功";
s[56] = "該卡已被使用";
s[57] = "充值失敗";
s[58] = "注意";
s[59] = "話機、卡號和密碼都不能為空";
s[60] = "綁定號碼快捷充值";
s[61] = "話機號碼";
s[62] = "充值卡號";
s[63] = "充值密碼";
s[64] = "充　值";
s[65] = "過濾條件";
s[66] = "起始時間";
s[67] = "終止時間";
s[68] = "主叫號碼";
s[69] = "被叫號碼";
s[70] = "過　　濾";
s[71] = "網內通話";
s[72] = "本地市話";
s[73] = "號　碼";
s[74] = "國內長途";
s[75] = "國際長途";
s[76] = "通話時長";
s[77] = "通話費用";
s[78] = "套餐時長";
s[79] = "套餐費用";
s[80] = "通話類型";
s[81] = "話單明細";
s[82] = "請輸入正確的過濾條件";
s[83] = "查詢結果";
s[84] = "終端標識";
s[85] = "費用總計";
s[86] = "時長總計";
s[87] = "套餐費用總計";
s[88] = "套餐時長總計";
s[89] = "本地費用";
s[90] = "本地時長";
s[91] = "卡　號";
s[92] = "打印";
s[93] = "國內長途費用";
s[94] = "國內長途時長";
s[95] = "國際長途費用";
s[96] = "國際長途時長";
s[97] = "網內費用";
s[98] = "網內時長";
s[99] = "費用查詢";
s[100] = "費率前綴";
s[101] = "費率類型";
s[102] = "地區名稱";
s[103] = "地區前綴";
s[104] = "首次時長";
s[105] = "計費費率";
s[106] = "計費周期";
s[107] = "賬戶費率表";
s[108] = "繳費";
s[109] = "沖正";
s[110] = "開戶";
s[111] = "其他";
s[112] = "現金";
s[113] = "支票";
s[114] = "充值卡";
s[115] = "信用卡";
s[116] = "套餐租金";
s[117] = "繳費金額";
s[118] = "繳費類型";
s[119] = "繳費時間";
s[120] = "繳費方式";
s[121] = "備注";
s[122] = "賬戶繳費記錄";
s[123] = "查詢中...";
s[124] = "信息設置";
s[125] = "聯系人";
s[126] = "證件類型";
s[127] = "身份證";
s[128] = "護　照";
s[129] = "軍官證";
s[130] = "工作證";
s[131] = "學生證";
s[132] = "其　他";
s[133] = "請選擇...";
s[134] = "傳真號碼";
s[135] = "郵政編碼";
s[136] = "聯系電話";
s[137] = "證件號碼";
s[138] = "電子郵箱";
s[139] = "詳細地址";
s[140] = "確定";
s[141] = "修改成功";
s[142] = "修改失敗";
s[143] = "表單填寫有錯誤,請更正";
s[144] = "卡號和密碼都不能為空";
s[145] = "業務設置";
s[146] = "來電顯示";
s[147] = "開通";
s[148] = "呼叫轉移";
s[149] = "免打擾";
s[150] = "激活";
s[151] = "遇忙前轉";
s[152] = "前轉號碼";
s[153] = "無條件前轉";
s[154] = "無應答前轉";
s[155] = "應用";
s[156] = "業務未作變更";
s[157] = "原密碼";
s[158] = "新密碼";
s[159] = "請確認";
s[160] = "兩次輸入的新密碼不同";
s[161] = "新密碼與原密碼相同";
s[162] = "電話卡充值";
s[163] = "[注銷]";
s[164] = "VOS3000 VoIP運營支撐系統";
s[165] = "歡迎";
s[166] = "歡迎進入VOS3000網絡電話-Web自助系統，請點擊左側 [ 系統菜單 ] 進行操作。";
s[167] = "如果您需要幫助，請點擊這裏：";
s[168] = "系統幫助";
s[169] = "版本: 2.1.8.00";
s[170] = "登錄信息";
s[171] = "[刷新]";
s[172] = "注意事項";
s[173] = "查詢結束後請點擊";
s[174] = "安全退出";
s[175] = "經常更改密碼可有效提高安全性";
s[176] = "賬戶號碼";
s[177] = "賬戶套餐";
s[178] = "套餐名稱";
s[179] = "租用單位";
s[180] = "套餐金額";
s[181] = "贈送話費餘額";
s[182] = "失效時間";
s[183] = "日";
s[184] = "月";
s[185] = "年";
s[186] = "賬戶套餐查詢";
s[187] = "生效套餐";
s[188] = "時段費率";
s[189] = "費率組名稱";
s[190] = "時段類型";
s[191] = "起始日";
s[192] = "終止日";
s[193] = "周時段";
s[194] = "月時段";
s[195] = "年時段";
s[196] = "贈送時長";
s[197] = "贈送時長餘量";
s[198] = "您沒有已生效套餐";
s[199] = "賬戶套餐定制";
s[200] = "套餐定制";
s[201] = "生效時間";
s[202] = "已選套餐";
s[203] = "可選套餐";
s[204] = "操作";
s[205] = "刪除";
s[206] = "添加";
s[207] = "套餐";
s[208] = "費率組";
s[209] = "費率";
s[210] = "抱歉，您沒有可選套餐";
s[211] = "套餐設置成功，稍後將自動更新套餐訂單列表";
s[212] = "賬戶充值";
s[213] = "類　型";
s[214] = "電話卡";
s[215] = "電話卡費用匯總";
s[216] = "電話卡話單查詢";
s[217] = "電話卡密碼修改";
s[218] = "電話卡查詢";
s[219] = "計費方式";
s[220] = "主叫";
s[221] = "被叫";
s[222] = "被叫計費";
s[223] = "日期";
s[224] = "日報表";
s[225] = "月報表";
s[226] = "月份";
s[227] = "賬戶日報表";
s[228] = "賬戶月報表";
s[229] = "日消費";
s[230] = "賬戶日消費";
s[231] = "圖表";
s[232] = "正在為您接通，請稍後…";
s[233] = "手機";
s[234] = "固話";
s[235] = "IP電話";
s[236] = "設備類型";
s[237] = "辦公";
s[238] = "家庭";
s[239] = "地址類型";
s[240] = "Web電話";
s[241] = "將此號碼存入電話本";
s[242] = "輸入號碼或聯系人";
s[243] = "呼叫";
s[244] = "添加聯系人";
s[245] = "刪除聯系人";
s[246] = "詳細";
s[247] = "請輸入您的接聽號碼";
s[248] = "請輸入一個號碼";
s[249] = "校驗";
s[250] = "電話卡校驗";
s[251] = "金額";
s[252] = "失效日期";
s[253] = "有效期(天)";
s[254] = "電話卡激活";
s[255] = "綁定時間";
s[256] = "號碼查詢";
s[257] = "賬戶綁定號碼表";
s[258] = "綁定號碼";
s[259] = "綁定號碼";
s[260] = "聯系人";
s[261] = "保存號碼";
s[262] = "請輸入您要撥打的號碼";
s[263] = "昆石軟交換";
s[264] = "雙擊呼叫此號碼";
s[265] = "服務器時區";
s[266] = "結算網關";
s[267] = "租用周期";
s[268] = "贈送金額";
s[269] = "賬戶私有費率查詢";
s[270] = "私有費率查詢";
s[271] = "話機私有費率查詢";
s[272] = "話機費率表";
s[273] = "前轉方式";
s[274] = "順序";
s[275] = "輪詢";
s[276] = "隨機";
s[277] = "振鈴時長";
s[278] = "兩次輸入的號碼不同";
s[279] = "彩鈴";
s[280] = "彩鈴透傳";
s[281] = "鈴音名稱";
s[282] = "無法接通語音提示";
s[283] = "通話剩餘時長插播";
s[284] = "賬戶餘額不足告警";
s[285] = "默認";
s[286] = "開啟";
s[287] = "提示餘額";
s[288] = "提示時長";
s[289] = "電話本";
s[290] = "賬戶電話本";
s[291] = "話機電話本";
s[292] = "請提交或取消修改";
s[293] = "查詢密碼修改";
s[294] = "企業總機";
s[295] = "撥打分機";
s[296] = "語音留言";
s[297] = "直撥";
s[298] = "回撥";
s[299] = "模板";
s[300] = "語音文件";
s[301] = "語音服務";
s[302] = "直撥按鍵";
s[303] = "回撥按鍵";
s[304] = "語音留言按鍵";
s[305] = "等待語音";
s[306] = "按鍵配置";
s[307] = "按鍵";
s[308] = "短號";
s[309] = "確認刪除選擇的項目？";
s[310] = "時段沖突";
s[311] = "語音名稱";
s[312] = "存儲大小";
s[313] = "分機管理";
s[314] = "電話號碼";
s[315] = "文件上傳";
s[316] = "單聲道/16位/8kHz/1 MB以下的wav文件";
s[317] = "請選擇一個wav文件";
s[318] = "上傳失敗";
s[319] = "請選擇wav格式的文件";
s[320] = "上傳";
s[321] = "上傳操作會替換名稱相同的文件，是否繼續？";
s[322] = "請稍後";
s[323] = "正在上傳文件 ...";
s[324] = "上傳成功";
s[325] = "文件已存在";
s[326] = "文件大小超出限制";
s[327] = "賬戶信息";
s[328] = "時段配置";
s[329] = "按鍵及分機管理";
s[330] = "語音文件管理";
s[331] = "VOS3000 企業總機Web管理系統";
s[332] = "總機號碼";
s[333] = "歡迎進入VOS3000 企業總機Web管理系統，請點擊上方選項卡進行設置。";
s[334] = "配置密碼修改";
s[335] = "驗證碼";
s[336] = "換一個";
s[337] = "非本話機流程，無法修改。企業總機流程：";
s[338] = "請再次輸入";
s[339] = "部門";
s[340] = "話機月租";
s[341] = "話機消費不足";
s[342] = "套餐消費不足";
s[343] = "一次性";
s[344] = "下　　載";
s[345] = "其它消費";
s[346] = "其它消費記錄";
s[347] = "消費來源";
s[348] = "消費金額";
s[349] = "類型";
s[350] = "時間";
s[351] = "賬戶其它消費";

Ext.UpdateManager.defaults.indicatorText = '<div class="loading-indicator">加載中...</div>';

if(Ext.View)
{
    Ext.View.prototype.emptyText = "";
}

if(Ext.grid.GridPanel)
{
    Ext.grid.GridPanel.prototype.ddText = "{0} 選擇行";
}

if(Ext.TabPanelItem)
{
    Ext.TabPanelItem.prototype.closeText = "關閉";
}

if(Ext.form.Field)
{
    Ext.form.Field.prototype.invalidText = "輸入值非法";
}

if(Ext.LoadMask)
{
    Ext.LoadMask.prototype.msg = "加載中...";
}

Date.monthNames = [
    "一月",
    "二月",
    "三月",
    "四月",
    "五月",
    "六月",
    "七月",
    "八月",
    "九月",
    "十月",
    "十一",
    "十二"
];

Date.dayNames = [
    "日",
    "一",
    "二",
    "三",
    "四",
    "五",
    "六"
];

if(Ext.MessageBox)
{
    Ext.MessageBox.buttonText = {
        ok     : "確定",
        cancel : "取消",
        yes    : "是",
        no     : "否"
    };
}

if(Ext.util.Format)
{
    Ext.util.Format.date = function(v, format)
    {
        if(!v) return "";
        if(!(v instanceof Date)) v = new Date(Date.parse(v));
        return v.dateFormat(format || "y年m月d日");
    };
}

if(Ext.DatePicker)
{
    Ext.apply(Ext.DatePicker.prototype, {
        todayText         : "今天",
        minText           : "日期在最小日期之前",
        maxText           : "日期在最大日期之後",
        disabledDaysText  : "",
        disabledDatesText : "",
        monthNames        : Date.monthNames,
        dayNames          : Date.dayNames,
        nextText          : '下月 (Control+Right)',
        prevText          : '上月 (Control+Left)',
        monthYearText     : '選擇一個月 (Control+Up/Down 來改變年)',
        todayTip          : "{0} (空格鍵選擇)",
        format            : "y年m月d日",
        okText            : "確定",
        cancelText        : "取消"
    });
}

if(Ext.PagingToolbar)
{
    Ext.apply(Ext.PagingToolbar.prototype, {
        beforePageText : "頁",
        afterPageText  : "頁共 {0} 頁",
        firstText      : "第一頁",
        prevText       : "前一頁",
        nextText       : "下一頁",
        lastText       : "最後頁",
        refreshText    : "刷新",
        displayMsg     : "顯示 {0} - {1}，共 {2} 條",
        emptyMsg       : '沒有數據需要顯示'
    });
}

if(Ext.form.TextField)
{
    Ext.apply(Ext.form.TextField.prototype, {
        minLengthText : "該輸入項的最小長度是 {0}",
        maxLengthText : "該輸入項的最大長度是 {0}",
        blankText     : "該輸入項不能為空",
        regexText     : "",
        emptyText     : null
    });
}

if(Ext.form.NumberField)
{
    Ext.apply(Ext.form.NumberField.prototype, {
        minText : "該輸入項的最小值是 {0}",
        maxText : "該輸入項的最大值是 {0}",
        nanText : "{0} 不是有效數值"
    });
}

if(Ext.form.DateField)
{
    Ext.apply(Ext.form.DateField.prototype, {
        disabledDaysText  : "禁用",
        disabledDatesText : "禁用",
        minText           : "該輸入項的日期必須在 {0} 之後",
        maxText           : "該輸入項的日期必須在 {0} 之前",
        invalidText       : "{0} 是無效的日期 - 必須符合格式： {1}",
        format            : "y年m月d日"
    });
}

if(Ext.form.ComboBox)
{
    Ext.apply(Ext.form.ComboBox.prototype, {
        loadingText       : "加載中...",
        valueNotFoundText : undefined
    });
}

if(Ext.form.VTypes)
{
    Ext.apply(Ext.form.VTypes, {
        emailText    : '該輸入項必須是電子郵件地址，格式如： "user@domain.com"',
        urlText      : '該輸入項必須是URL地址，格式如： "http:/' + '/www.domain.com"',
        alphaText    : '該輸入項只能包含字符和_',
        alphanumText : '該輸入項只能包含字符,數字和_'
    });
}

if(Ext.grid.GridView)
{
    Ext.apply(Ext.grid.GridView.prototype, {
        sortAscText  : "正序",
        sortDescText : "逆序",
        lockText     : "鎖列",
        unlockText   : "解鎖列",
        columnsText  : "顯示列"
    });
}

if(Ext.grid.PropertyColumnModel)
{
    Ext.apply(Ext.grid.PropertyColumnModel.prototype, {
        nameText   : "名稱",
        valueText  : "值",
        dateFormat : "y年m月d日"
    });
}

if(Ext.layout.BorderLayout && Ext.layout.BorderLayout.SplitRegion)
{
    Ext.apply(Ext.layout.BorderLayout.SplitRegion.prototype, {
        splitTip            : "拖動來改變尺寸",
        collapsibleSplitTip : "拖動來改變尺寸 雙擊隱藏"
    });
}
