var s = new Array();
s[0] = "载入中...";
s[1] = "状态";
s[2] = "正在验证信息...";
s[3] = "登录失败";
s[4] = "发生错误";
s[5] = "无法连接到服务器";
s[6] = "错误";
s[7] = "请输入完整";
s[8] = "VOS3000";
s[9] = "Web自助系统";
s[10] = "系统登录";
s[11] = "名　称";
s[12] = "密　码";
s[13] = "登　录";
s[14] = "关闭";
s[15] = "关闭其他";
s[16] = "系统导航";
s[17] = "系统菜单";
s[18] = "话机查询";
s[19] = "网关查询";
s[20] = "账户查询";
s[21] = "自助服务";
s[22] = "网关费用汇总";
s[23] = "费用汇总";
s[24] = "网关话单查询";
s[25] = "话单查询";
s[26] = "网关密码修改";
s[27] = "密码修改";
s[28] = "话机费用汇总";
s[29] = "话机话单查询";
s[30] = "话机密码修改";
s[31] = "话机补充业务";
s[32] = "补充业务";
s[33] = "账户费用汇总";
s[34] = "账户话单查询";
s[35] = "账户基础费率查询";
s[36] = "基础费率查询";
s[37] = "账户缴费查询";
s[38] = "缴费查询";
s[39] = "账户信息修改";
s[40] = "信息修改";
s[41] = "账户充值";
s[42] = "查询失败";
s[43] = "系统导航";
s[44] = "Web自助查询";
s[45] = "登录名称";
s[46] = "登录类型";
s[47] = "账户号码";
s[48] = "账户名称";
s[49] = "账户余额";
s[50] = "透支限额";
s[51] = "话　机";
s[52] = "对接网关";
s[53] = "处理中...";
s[54] = "信息";
s[55] = "充值成功";
s[56] = "该卡已被使用";
s[57] = "充值失败";
s[58] = "注意";
s[59] = "话机、卡号和密码都不能为空";
s[60] = "绑定号码快捷充值";
s[61] = "话机号码";
s[62] = "充值卡号";
s[63] = "充值密码";
s[64] = "充　值";
s[65] = "过滤条件";
s[66] = "起始时间";
s[67] = "终止时间";
s[68] = "主叫号码";
s[69] = "被叫号码";
s[70] = "过　　滤";
s[71] = "网内通话";
s[72] = "本地市话";
s[73] = "号　码";
s[74] = "国内长途";
s[75] = "国际长途";
s[76] = "通话时长";
s[77] = "通话费用";
s[78] = "套餐时长";
s[79] = "套餐费用";
s[80] = "通话类型";
s[81] = "话单明细";
s[82] = "请输入正确的过滤条件";
s[83] = "查询结果";
s[84] = "终端标识";
s[85] = "费用总计";
s[86] = "时长总计";
s[87] = "套餐费用总计";
s[88] = "套餐时长总计";
s[89] = "本地费用";
s[90] = "本地时长";
s[91] = "卡　号";
s[92] = "打印";
s[93] = "国内长途费用";
s[94] = "国内长途时长";
s[95] = "国际长途费用";
s[96] = "国际长途时长";
s[97] = "网内费用";
s[98] = "网内时长";
s[99] = "费用查询";
s[100] = "费率前缀";
s[101] = "费率类型";
s[102] = "地区名称";
s[103] = "地区前缀";
s[104] = "首次时长";
s[105] = "计费费率";
s[106] = "计费周期";
s[107] = "账户费率表";
s[108] = "缴费";
s[109] = "冲正";
s[110] = "开户";
s[111] = "其他";
s[112] = "现金";
s[113] = "支票";
s[114] = "充值卡";
s[115] = "信用卡";
s[116] = "套餐租金";
s[117] = "缴费金额";
s[118] = "缴费类型";
s[119] = "缴费时间";
s[120] = "缴费方式";
s[121] = "备注";
s[122] = "账户缴费记录";
s[123] = "查询中...";
s[124] = "信息设置";
s[125] = "联系人";
s[126] = "证件类型";
s[127] = "身份证";
s[128] = "护　照";
s[129] = "军官证";
s[130] = "工作证";
s[131] = "学生证";
s[132] = "其　他";
s[133] = "请选择...";
s[134] = "传真号码";
s[135] = "邮政编码";
s[136] = "联系电话";
s[137] = "证件号码";
s[138] = "电子邮箱";
s[139] = "详细地址";
s[140] = "确定";
s[141] = "修改成功";
s[142] = "修改失败";
s[143] = "表单填写有错误,请更正";
s[144] = "卡号和密码都不能为空";
s[145] = "业务设置";
s[146] = "来电显示";
s[147] = "开通";
s[148] = "呼叫转移";
s[149] = "免打扰";
s[150] = "激活";
s[151] = "遇忙前转";
s[152] = "前转号码";
s[153] = "无条件前转";
s[154] = "无应答前转";
s[155] = "应用";
s[156] = "业务未作变更";
s[157] = "原密码";
s[158] = "新密码";
s[159] = "请确认";
s[160] = "两次输入的新密码不同";
s[161] = "新密码与原密码相同";
s[162] = "电话卡充值";
s[163] = "[注销]";
s[164] = "VOS3000 VoIP运营支撑系统";
s[165] = "欢迎";
s[166] = "欢迎进入VOS3000网络电话-Web自助系统，请点击左侧 [ 系统菜单 ] 进行操作。";
s[167] = "如果您需要帮助，请点击这里：";
s[168] = "系统帮助";
s[169] = "版本: 2.1.8.00";
s[170] = "登录信息";
s[171] = "[刷新]";
s[172] = "注意事项";
s[173] = "查询结束后请点击";
s[174] = "安全退出";
s[175] = "经常更改密码可有效提高安全性";
s[176] = "账户号码";
s[177] = "账户套餐";
s[178] = "套餐名称";
s[179] = "租用单位";
s[180] = "套餐金额";
s[181] = "赠送话费余额";
s[182] = "失效时间";
s[183] = "日";
s[184] = "月";
s[185] = "年";
s[186] = "账户套餐查询";
s[187] = "生效套餐";
s[188] = "时段费率";
s[189] = "费率组名称";
s[190] = "时段类型";
s[191] = "起始日";
s[192] = "终止日";
s[193] = "周时段";
s[194] = "月时段";
s[195] = "年时段";
s[196] = "赠送时长";
s[197] = "赠送时长余量";
s[198] = "您没有已生效套餐";
s[199] = "账户套餐定制";
s[200] = "套餐定制";
s[201] = "生效时间";
s[202] = "已选套餐";
s[203] = "可选套餐";
s[204] = "操作";
s[205] = "删除";
s[206] = "添加";
s[207] = "套餐";
s[208] = "费率组";
s[209] = "费率";
s[210] = "抱歉，您没有可选套餐";
s[211] = "套餐设置成功，稍后将自动更新套餐订单列表";
s[212] = "账户充值";
s[213] = "类　型";
s[214] = "电话卡";
s[215] = "电话卡费用汇总";
s[216] = "电话卡话单查询";
s[217] = "电话卡密码修改";
s[218] = "电话卡查询";
s[219] = "计费方式";
s[220] = "主叫";
s[221] = "被叫";
s[222] = "被叫计费";
s[223] = "日期";
s[224] = "日报表";
s[225] = "月报表";
s[226] = "月份";
s[227] = "账户日报表";
s[228] = "账户月报表";
s[229] = "日消费";
s[230] = "账户日消费";
s[231] = "图表";
s[232] = "正在为您接通，请稍后…";
s[233] = "手机";
s[234] = "固话";
s[235] = "IP电话";
s[236] = "设备类型";
s[237] = "办公";
s[238] = "家庭";
s[239] = "地址类型";
s[240] = "Web电话";
s[241] = "将此号码存入电话本";
s[242] = "输入号码或联系人";
s[243] = "呼叫";
s[244] = "添加联系人";
s[245] = "删除联系人";
s[246] = "详细";
s[247] = "请输入您的接听号码";
s[248] = "请输入一个号码";
s[249] = "校验";
s[250] = "电话卡校验";
s[251] = "金额";
s[252] = "失效日期";
s[253] = "有效期(天)";
s[254] = "电话卡激活";
s[255] = "绑定时间";
s[256] = "号码查询";
s[257] = "账户绑定号码表";
s[258] = "绑定号码";
s[259] = "绑定号码";
s[260] = "联系人";
s[261] = "保存号码";
s[262] = "请输入您要拨打的号码";
s[263] = "昆石软交换";
s[264] = "双击呼叫此号码";
s[265] = "服务器时区";
s[266] = "结算网关";
s[267] = "租用周期";
s[268] = "赠送金额";
s[269] = "账户私有费率查询";
s[270] = "私有费率查询";
s[271] = "话机私有费率查询";
s[272] = "话机费率表";
s[273] = "前转方式";
s[274] = "顺序";
s[275] = "轮询";
s[276] = "随机";
s[277] = "振铃时长";
s[278] = "两次输入的号码不同";
s[279] = "彩铃";
s[280] = "彩铃透传";
s[281] = "铃音名称";
s[282] = "无法接通语音提示";
s[283] = "通话剩余时长插播";
s[284] = "账户余额不足告警";
s[285] = "默认";
s[286] = "开启";
s[287] = "提示余额";
s[288] = "提示时长";
s[289] = "电话本";
s[290] = "账户电话本";
s[291] = "话机电话本";
s[292] = "请提交或取消修改";
s[293] = "查询密码修改";
s[294] = "企业总机";
s[295] = "拨打分机";
s[296] = "语音留言";
s[297] = "直拨";
s[298] = "回拨";
s[299] = "模板";
s[300] = "语音文件";
s[301] = "语音服务";
s[302] = "直拨按键";
s[303] = "回拨按键";
s[304] = "语音留言按键";
s[305] = "等待语音";
s[306] = "按键配置";
s[307] = "按键";
s[308] = "短号";
s[309] = "确认删除选择的项目？";
s[310] = "时段冲突";
s[311] = "语音名称";
s[312] = "存储大小";
s[313] = "分机管理";
s[314] = "电话号码";
s[315] = "文件上传";
s[316] = "单声道/16位/8kHz/1 MB以下的wav文件";
s[317] = "请选择一个wav文件";
s[318] = "上传失败";
s[319] = "请选择wav格式的文件";
s[320] = "上传";
s[321] = "上传操作会替换名称相同的文件，是否继续？";
s[322] = "请稍后";
s[323] = "正在上传文件 ...";
s[324] = "上传成功";
s[325] = "文件已存在";
s[326] = "文件大小超出限制";
s[327] = "账户信息";
s[328] = "时段配置";
s[329] = "按键及分机管理";
s[330] = "语音文件管理";
s[331] = "VOS3000 企业总机Web管理系统";
s[332] = "总机号码";
s[333] = "欢迎进入VOS3000 企业总机Web管理系统，请点击上方选项卡进行设置。";
s[334] = "配置密码修改";
s[335] = "验证码";
s[336] = "换一个";
s[337] = "非本话机流程，无法修改。企业总机流程：";
s[338] = "请再次输入";
s[339] = "部门";
s[340] = "话机月租";
s[341] = "话机消费不足";
s[342] = "套餐消费不足";
s[343] = "一次性";
s[344] = "下　　载";
s[345] = "其它消费";
s[346] = "其它消费记录";
s[347] = "消费来源";
s[348] = "消费金额";
s[349] = "类型";
s[350] = "时间";
s[351] = "账户其它消费";

Ext.UpdateManager.defaults.indicatorText = '<div class="loading-indicator">加载中...</div>';

if(Ext.View)
{
    Ext.View.prototype.emptyText = "";
}

if(Ext.grid.GridPanel)
{
    Ext.grid.GridPanel.prototype.ddText = "{0} 选择行";
}

if(Ext.TabPanelItem)
{
    Ext.TabPanelItem.prototype.closeText = "关闭";
}

if(Ext.form.Field)
{
    Ext.form.Field.prototype.invalidText = "输入值非法";
}

if(Ext.LoadMask)
{
    Ext.LoadMask.prototype.msg = "加载中...";
}

Date.monthNames = [
    "一月",
    "二月",
    "三月",
    "四月",
    "五月",
    "六月",
    "七月",
    "八月",
    "九月",
    "十月",
    "十一",
    "十二"
];

Date.dayNames = [
    "日",
    "一",
    "二",
    "三",
    "四",
    "五",
    "六"
];

if(Ext.MessageBox)
{
    Ext.MessageBox.buttonText = {
        ok     : "确定",
        cancel : "取消",
        yes    : "是",
        no     : "否"
    };
}

if(Ext.util.Format)
{
    Ext.util.Format.date = function(v, format)
    {
        if(!v) return "";
        if(!(v instanceof Date)) v = new Date(Date.parse(v));
        return v.dateFormat(format || "y年m月d日");
    };
}

if(Ext.DatePicker)
{
    Ext.apply(Ext.DatePicker.prototype, {
        todayText         : "今天",
        minText           : "日期在最小日期之前",
        maxText           : "日期在最大日期之后",
        disabledDaysText  : "",
        disabledDatesText : "",
        monthNames        : Date.monthNames,
        dayNames          : Date.dayNames,
        nextText          : '下月 (Control+Right)',
        prevText          : '上月 (Control+Left)',
        monthYearText     : '选择一个月 (Control+Up/Down 来改变年)',
        todayTip          : "{0} (空格键选择)",
        format            : "y年m月d日",
        okText            : "确定",
        cancelText        : "取消"
    });
}

if(Ext.PagingToolbar)
{
    Ext.apply(Ext.PagingToolbar.prototype, {
        beforePageText : "页",
        afterPageText  : "页共 {0} 页",
        firstText      : "第一页",
        prevText       : "前一页",
        nextText       : "下一页",
        lastText       : "最后页",
        refreshText    : "刷新",
        displayMsg     : "显示 {0} - {1}，共 {2} 条",
        emptyMsg       : '没有数据需要显示'
    });
}

if(Ext.form.TextField)
{
    Ext.apply(Ext.form.TextField.prototype, {
        minLengthText : "该输入项的最小长度是 {0}",
        maxLengthText : "该输入项的最大长度是 {0}",
        blankText     : "该输入项不能为空",
        regexText     : "",
        emptyText     : null
    });
}

if(Ext.form.NumberField)
{
    Ext.apply(Ext.form.NumberField.prototype, {
        minText : "该输入项的最小值是 {0}",
        maxText : "该输入项的最大值是 {0}",
        nanText : "{0} 不是有效数值"
    });
}

if(Ext.form.DateField)
{
    Ext.apply(Ext.form.DateField.prototype, {
        disabledDaysText  : "禁用",
        disabledDatesText : "禁用",
        minText           : "该输入项的日期必须在 {0} 之后",
        maxText           : "该输入项的日期必须在 {0} 之前",
        invalidText       : "{0} 是无效的日期 - 必须符合格式： {1}",
        format            : "y年m月d日"
    });
}

if(Ext.form.ComboBox)
{
    Ext.apply(Ext.form.ComboBox.prototype, {
        loadingText       : "加载中...",
        valueNotFoundText : undefined
    });
}

if(Ext.form.VTypes)
{
    Ext.apply(Ext.form.VTypes, {
        emailText    : '该输入项必须是电子邮件地址，格式如： "user@domain.com"',
        urlText      : '该输入项必须是URL地址，格式如： "http:/' + '/www.domain.com"',
        alphaText    : '该输入项只能包含字符和_',
        alphanumText : '该输入项只能包含字符,数字和_'
    });
}

if(Ext.grid.GridView)
{
    Ext.apply(Ext.grid.GridView.prototype, {
        sortAscText  : "正序",
        sortDescText : "逆序",
        lockText     : "锁列",
        unlockText   : "解锁列",
        columnsText  : "显示列"
    });
}

if(Ext.grid.PropertyColumnModel)
{
    Ext.apply(Ext.grid.PropertyColumnModel.prototype, {
        nameText   : "名称",
        valueText  : "值",
        dateFormat : "y年m月d日"
    });
}

if(Ext.layout.BorderLayout && Ext.layout.BorderLayout.SplitRegion)
{
    Ext.apply(Ext.layout.BorderLayout.SplitRegion.prototype, {
        splitTip            : "拖动来改变尺寸",
        collapsibleSplitTip : "拖动来改变尺寸 双击隐藏"
    });
}
